HRMREDChuklinTest.ZUPC/src/InformationRegisters/ТекущиеКадровыеДанныеСотрудников/ТекущиеКадровыеДанныеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="55f96922-028d-4a96-a3c9-653b994a0706">
  <name>ТекущиеКадровыеДанныеСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="3d3bd907-82d8-4053-af99-ccc82cd0db7e">
    <name>КоличествоСтавок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>22</precision>
          <scale>20</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="90e09cae-c7a4-4f25-84de-c27440b64872">
    <name>ДатаУвольнения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9ff86afd-b8eb-441b-80f8-caf217d5d8c0">
    <name>ТекущееПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b9d20b2d-2b8b-47e4-a638-1e8193d73498">
    <name>ОсновноеРабочееМестоВОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="95c957a3-253d-40b3-b048-0d4b596c7f6d">
    <name>ТекущаяДолжность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b44fe2e8-7e7d-49f3-8093-d1168b8ea6bf">
    <name>УдалитьТекущаяДолжностьПоШтатномуРасписанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="86ad1530-e436-4c70-83a1-4a65b12d4227">
    <name>ДатаПриема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5ad687b9-d72d-492f-8689-63d3125ff1e1">
    <name>ТекущийВидЗанятости</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="8b162a19-847f-4ae7-8b7f-44ff03d9d607">
    <name>УдалитьТекущийВидДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="116fa0c3-d229-4c7d-bbc2-b7eace52fa41">
    <name>ОформленПоТрудовомуДоговору</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="6e2ac4ce-cd62-461a-bb51-f527a812727b">
    <name>УдалитьТекущаяТерритория</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb0c087a-f25c-4015-b8c9-6e6e97c5f537">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="78e252f8-2002-4f46-9ad8-b27563ee317b">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b89e1f07-1182-491c-aeaf-e07889652d10">
    <name>ГоловнаяОрганизация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="67f3d1be-ad78-436f-9290-377da8f2287c">
    <name>ТекущаяОрганизация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

HRMREDChuklinTest.ZUPC/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="33e0072d-7d5b-4298-ae77-31a7cb358f5d">
  <name>ФизическиеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1051c0c7-1058-427c-8bf5-5e30b8fbfb54">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b27688c3-6682-45e1-a03f-0d2e8b1214e4">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="faac3921-1e00-49dd-9bb0-4a7f0e978f40">
    <name>МестоРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>240</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8accddff-65fa-4075-98d0-0526bb454d14">
    <name>СтраховойНомерПФР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d51a45d1-6705-4cb5-bbd1-a0af3ac1c3a3">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f20201ce-88a2-4584-a9c7-ac67fe446cbc">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7ab78d29-6c6c-4386-aa50-7c79135099c6">
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f0c489a-46a7-4681-bbb7-c4601e7e4c25">
    <name>УточнениеНаименования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ZUPC_DateJoingGroup</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_Спеллинг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_EmergencyContacts</name>
    <type>
      <types>CatalogRef.ZUPC_EmergencyContact</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="371719bc-4e89-490e-8988-c8205ed189db">
    <name>НаименованиеСлужебное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="5a75d200-9ec3-4490-aed6-3855b5a7af2b">
    <name>УдалитьОбразование</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2b09e1fa-d05a-42e9-805f-a441c06fbd25">
    <name>УдалитьСтажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c4dba6ca-3513-489d-86c4-0814ed6fbc8b">
    <name>УдалитьПрофессии</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a93c344f-679d-4b15-b4a4-b9b2eb440808">
    <name>УдалитьУченыеЗвания</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="62e145df-0b2d-4b8e-99ca-cf9fd9d4117e">
    <name>УдалитьНаграды</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="937cbddc-9439-4c29-9ecc-96f8cfec28c8">
    <name>УдалитьЗнаниеЯзыков</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="dd9d1f7f-6987-477e-9f5f-660accc0ab7f">
    <name>УдалитьТрудоваяДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="eeb1380c-89c4-49fb-94ff-3e89b452971b">
    <name>УдалитьУченыеСтепени</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f4786c82-ddee-4568-b75a-9c271f57866e">
    <name>УдалитьСоставСемьи</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

HRMREDChuklinTest.ZUPC/src/CommonModules/ZUPC_ПоискСотрудниковExpress/Module.bsl
#Область ПрограммныйИнтерфейс

// Ищет элементы справочника "Сотрудники" по фамилии физического лица.
// Сначала выполняется точное сравнение фамилии, а при отсутствии результата - нечеткое.
//
// Параметры:
//  Фамилия - Строка
//      Фамилия сотрудника без имени и отчества.
//
// Возвращаемое значение:
//  Структура
//      Поля:
//       * Сотрудники - Массив из Структура - найденные трудоустройства.
//       * НечеткийПоиск - Булево - признак использования нечеткого поиска.
//       * НайденнаяФамилия - Строка - фамилия, выбранная нечетким поиском.
//
Функция НайтиСотрудниковПоФамилии(Знач Фамилия) Экспорт
	ИскомаяФамилия = НормализованнаяФамилия(Фамилия);
	Результат = Новый Структура("Сотрудники, НечеткийПоиск, НайденнаяФамилия", Новый Массив, Ложь, "");
	Если ПустаяСтрока(ИскомаяФамилия) Тогда
		Возврат Результат;
	КонецЕсли;
	Кандидаты = ПолучитьКандидатовПоиска();
	ФизическиеЛица = Новый Массив;
	Для Каждого Кандидат Из Кандидаты Цикл
		Если НормализованнаяФамилия(ФамилияИзФИО(Кандидат.ФИО)) = ИскомаяФамилия Тогда
			ФизическиеЛица.Добавить(Кандидат.ФизическоеЛицо);
		КонецЕсли;
	КонецЦикла;
	Если ФизическиеЛица.Количество() = 0 Тогда
		ДанныеНечеткогоПоиска = ПодобратьПохожиеФамилии(Кандидаты, ИскомаяФамилия);
		ФизическиеЛица = ДанныеНечеткогоПоиска.ФизическиеЛица;
		Результат.НечеткийПоиск = ФизическиеЛица.Количество() > 0;
		Результат.НайденнаяФамилия = ДанныеНечеткогоПоиска.НайденнаяФамилия;
	КонецЕсли;
	Если ФизическиеЛица.Количество() > 0 Тогда
		Результат.Сотрудники = ПолучитьДанныеСотрудников(ФизическиеЛица);
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКандидатовПоиска()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФизическиеЛица.ФИО КАК ФИО
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО Сотрудники.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|	И НЕ ФизическиеЛица.ПометкаУдаления
		|	И Сотрудники.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	И ФизическиеЛица.ФИО <> """"";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПодобратьПохожиеФамилии(Знач Кандидаты, Знач ИскомаяФамилия)
	МинимальноеРасстояние = Неопределено;
	ДопустимоеРасстояние = ДопустимоеРасстояниеРедактирования(СтрДлина(ИскомаяФамилия));
	ПодходящиеФамилии = Новый Соответствие;
	Для Каждого Кандидат Из Кандидаты Цикл
		ФамилияКандидата = НормализованнаяФамилия(ФамилияИзФИО(Кандидат.ФИО));
		Если ПустаяСтрока(ФамилияКандидата) Тогда
			Продолжить;
		КонецЕсли;
		Расстояние = РасстояниеРедактирования(ИскомаяФамилия, ФамилияКандидата);
		Если Расстояние > ДопустимоеРасстояние Тогда
			Продолжить;
		КонецЕсли;
		Если МинимальноеРасстояние = Неопределено Или Расстояние < МинимальноеРасстояние Тогда
			МинимальноеРасстояние = Расстояние;
			ПодходящиеФамилии.Очистить();
		КонецЕсли;
		Если Расстояние = МинимальноеРасстояние Тогда
			ПодходящиеФамилии.Вставить(ФамилияКандидата, Истина);
		КонецЕсли;
	КонецЦикла;
	ФизическиеЛица = Новый Массив;
	Для Каждого Кандидат Из Кандидаты Цикл
		ФамилияКандидата = НормализованнаяФамилия(ФамилияИзФИО(Кандидат.ФИО));
		Если ПодходящиеФамилии.Получить(ФамилияКандидата) <> Неопределено Тогда
			ФизическиеЛица.Добавить(Кандидат.ФизическоеЛицо);
		КонецЕсли;
	КонецЦикла;
	НайденныеФамилии = Новый Массив;
	Для Каждого ЭлементСоответствия Из ПодходящиеФамилии Цикл
		НайденныеФамилии.Добавить(ЭлементСоответствия.Ключ);
	КонецЦикла;
	Возврат Новый Структура(
		"ФизическиеЛица, НайденнаяФамилия", ФизическиеЛица, СтрСоединить(НайденныеФамилии, ", "));
КонецФункции

Функция ПолучитьДанныеСотрудников(Знач ФизическиеЛица)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	ФизическиеЛица.ФИО КАК ФИО,
		|	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
		|	ЕСТЬNULL(КадроваяИстория.ДолжностьПоШтатномуРасписанию.Должность,
		|		ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК Должность,
		|	ЕСТЬNULL(ТекущиеКадровыеДанные.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУвольнения
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО Сотрудники.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанные
		|		ПО Сотрудники.Ссылка = ТекущиеКадровыеДанные.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(
		|				, Сотрудник.ФизическоеЛицо В (&ФизическиеЛица)) КАК КадроваяИстория
		|		ПО Сотрудники.Ссылка = КадроваяИстория.Сотрудник
		|ГДЕ
		|	Сотрудники.ФизическоеЛицо В(&ФизическиеЛица)
		|	И НЕ Сотрудники.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИО,
		|	Сотрудник";
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	ТаблицаСотрудников = Запрос.Выполнить().Выгрузить();
	Результат = Новый Массив;
	Для Каждого СтрокаСотрудника Из ТаблицаСотрудников Цикл
		ДатаУвольнения = СтрокаСотрудника.ДатаУвольнения;
		СотрудникРаботает = ДатаУвольнения = '00010101'
			Или ДатаУвольнения >= НачалоДня(ТекущаяДатаСеанса());
		Статус = ?(СотрудникРаботает, "работает", "уволен");
		ДанныеСотрудника = Новый Структура(
			"Сотрудник, ФИО, ДатаРождения, Должность, Статус, ДатаУвольнения");
		ЗаполнитьЗначенияСвойств(ДанныеСотрудника, СтрокаСотрудника);
		ДанныеСотрудника.Статус = Статус;
		Результат.Добавить(ДанныеСотрудника);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ФамилияИзФИО(Знач ФИО)
	ЧастиФИО = СтрРазделить(СокрЛП(ФИО), " ", Ложь);
	Возврат ?(ЧастиФИО.Количество() = 0, "", ЧастиФИО[0]);
КонецФункции

Функция НормализованнаяФамилия(Знач Фамилия)
	Результат = ВРег(СокрЛП(Строка(Фамилия)));
	Возврат СтрЗаменить(Результат, "Ё", "Е");
КонецФункции

Функция ДопустимоеРасстояниеРедактирования(Знач ДлинаСтроки)
	Если ДлинаСтроки <= 4 Тогда
		Возврат 1;
	ИначеЕсли ДлинаСтроки <= 8 Тогда
		Возврат 2;
	КонецЕсли;
	Возврат 3;
КонецФункции

Функция РасстояниеРедактирования(Знач Строка1, Знач Строка2)
	Длина1 = СтрДлина(Строка1);
	Длина2 = СтрДлина(Строка2);
	ПредыдущаяСтрока = Новый Массив;
	Для Индекс = 0 По Длина2 Цикл
		ПредыдущаяСтрока.Добавить(Индекс);
	КонецЦикла;
	Для Индекс1 = 1 По Длина1 Цикл
		ТекущаяСтрока = Новый Массив;
		ТекущаяСтрока.Добавить(Индекс1);
		Для Индекс2 = 1 По Длина2 Цикл
			СтоимостьЗамены = ?(
				Сред(Строка1, Индекс1, 1) = Сред(Строка2, Индекс2, 1), 0, 1);
			Удаление = ПредыдущаяСтрока[Индекс2] + 1;
			Вставка = ТекущаяСтрока[Индекс2 - 1] + 1;
			Замена = ПредыдущаяСтрока[Индекс2 - 1] + СтоимостьЗамены;
			ТекущаяСтрока.Добавить(МинимумИзТрех(Удаление, Вставка, Замена));
		КонецЦикла;
		ПредыдущаяСтрока = ТекущаяСтрока;
	КонецЦикла;
	Возврат ПредыдущаяСтрока[Длина2];
КонецФункции

Функция МинимумИзТрех(Знач Значение1, Знач Значение2, Знач Значение3)
	Минимум = ?(Значение1 < Значение2, Значение1, Значение2);
	Возврат ?(Минимум < Значение3, Минимум, Значение3);
КонецФункции

#КонецОбласти
